In [1]:
# Importando o pandas
import pandas as pd

In [2]:
# Carregando arquivos
path = "/content/drive/MyDrive/Colab Notebooks/DIO_AnaliseDadosPythonPandas/datasets"
df1 = pd.read_excel(path+"/"+"Aracaju.xlsx")
df2 = pd.read_excel(path+"/"+"Fortaleza.xlsx")
df3 = pd.read_excel(path+"/"+"Natal.xlsx")
df4 = pd.read_excel(path+"/"+"Recife.xlsx")
df5 = pd.read_excel(path+"/"+"Salvador.xlsx")

In [3]:
df1.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [4]:
# Unindo todos os arquivos
df = pd.concat([df1,df2,df3,df4,df5])

In [5]:
df.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [6]:
df.tail()

       Cidade       Data  Vendas  LojaID  Qtde
235  Salvador 2019-01-03   41.84    1034     1
236  Salvador 2019-01-03  126.29    1035     3
237  Salvador 2019-01-03   38.06    1036     3
238  Salvador 2019-01-03  139.64    1035     1
239  Salvador 2019-01-03  161.41    1037     3

In [20]:
# Exibindo uma amostra aleatoria de linhas
df.sample(10)

        Cidade       Data  Vendas LojaID  Qtde
54   Fortaleza 2019-01-01   16.73   1002     5
32       Natal 2019-03-17  244.00    854     2
205   Salvador 2019-01-02  196.09   1037     1
89       Natal 2019-01-02   17.46   1034     1
34     Aracaju 2018-01-01   38.25   1521     6
77    Salvador 2019-01-01  218.76   1037     1
41      Recife 2019-02-13  157.78    981     4
65      Recife 2019-01-01    4.01    981     1
77     Aracaju 2018-01-01   24.10   1522     1
67   Fortaleza 2019-01-01   43.51   1003     1

In [8]:
# Exibindo o tipo de dados das colunas
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID             int64
Qtde               int64
dtype: object

Caso não seja necessário realizar calculos em uma determina coluna, é uma boa prática alterar seu tipo para Object

In [10]:
df["LojaID"] = df["LojaID"].astype("object")

In [26]:
# Exibindo valores faltantes
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

Caso existam valores faltantes é necessário avaliar o caso de uso da análise que está sendo realizada bem como o contexto dos dados e assim tomar uma decisão de qual abordagem tomar.



*   Substituição dos valores pela média
*   Substituição dos Valores pela mediana
*   Substituição dos Valores nulos por 0 (Zero)
*   Exclusão das linhas que contém alguma coluna nula
*   Exclusão das linhas que contém valor nulo em uma coluna específica
*   Exclusão somente das linhas que contém todas as colunas nulas

In [27]:
# Substituição dos valores pela média
# O parâmetro "inplace=True" indica que você quer persistir a alteração que está sendo feita no dataset atual, caso não utilizasse o parâmetro, deve-se atribuir o comando a variável df
df["Vendas"].fillna(df["Vendas"].mean(), inplace=True)

In [29]:
#Substituição dos Valores pela mediana
df["Vendas"].fillna(df["Vendas"].median(), inplace=True)

In [30]:
# Substituição dos Valores nulos por 0 (Zero)
df["Vendas"].fillna(0, inplace=True)

In [ ]:
# Exclusão das linhas que contém alguma coluna nula
df.dropna(inplace=True)

In [ ]:
# Exclusão das linhas que contém valor nulo em uma coluna específica
df.dropna(subset=["Vendas"], inplace=True)

In [ ]:
# Exclusão somente das linhas que contém todas as colunas nulas
 df.dropna(how="all", inplace=True)

**Incluindo novas colunas**

In [32]:
df["Receita"] = df["Vendas"] * df["Qtde"]

In [33]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita
0  Aracaju 2018-01-01  142.00   1520     1   142.00
1  Aracaju 2018-01-01   14.21   1522     6    85.26
2  Aracaju 2018-01-01   71.55   1520     1    71.55
3  Aracaju 2018-01-01    3.01   1521     7    21.07
4  Aracaju 2018-01-01   24.51   1522     8   196.08

In [34]:
df["Receita/Vendas"] = df["Receita"] / df["Vendas"]

In [35]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
0  Aracaju 2018-01-01  142.00   1520     1   142.00             1.0
1  Aracaju 2018-01-01   14.21   1522     6    85.26             6.0
2  Aracaju 2018-01-01   71.55   1520     1    71.55             1.0
3  Aracaju 2018-01-01    3.01   1521     7    21.07             7.0
4  Aracaju 2018-01-01   24.51   1522     8   196.08             8.0

In [37]:
# Obtendo a maior receita
df["Receita"].max()

3544.0

In [38]:
# Menor Receita
df["Receita"].min()

3.34

In [39]:
# Maiores valores, indicando quantidade de linhas do topo e a coluna que se deseja
df.nlargest(5, "Receita")

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0
30  Natal 2018-10-02   856.0    853     4   3424.0             4.0
41  Natal 2018-05-20   835.0    852     4   3340.0             4.0

In [41]:
# Menores valores, indicando quantidade de linhas e a coluna que se deseja
df.nsmallest(5, "Receita")

       Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
118   Aracaju 2018-01-01    3.34   1522     1     3.34             1.0
65     Recife 2019-01-01    4.01    981     1     4.01             1.0
92      Natal 2019-01-02    4.57   1035     1     4.57             1.0
92   Salvador 2019-01-01    4.57   1035     1     4.57             1.0
95      Natal 2019-01-02    5.13   1035     1     5.13             1.0

In [45]:
# Agrupando por cidade
df.groupby("Cidade")["Receita"].sum()

Cidade
Aracaju       48748.25
Fortaleza     37913.97
Natal        167227.52
Recife        51936.51
Salvador      40596.73
Name: Receita, dtype: float64